9/data/attachments/4a5d61e61fe9f049.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_b9e16bab-8608-4bc4-8d04-c9a69ef54cc2</nif:username>
            <nif:friendToBeAdded>Patricia_somebody_Friend_40641_5</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>